stories/notes/emacs.org
#+BEGIN_COMMENT
.. title: Emacs Notes
.. slug: emacs
.. date: 1/24/2014
.. tags: emacs
.. link:
.. description: Notes on things I've learned in emacs
.. type: text
#+END_COMMENT
#+OPTIONS: toc:nil num:t ^:nil
#+TOC: headlines 3

* eshell

** Changing the timeout on sudo
   By default in the eshell, you have to enter your password for sudo
   everytime I sudo something. This gets a bit annoying since I often
   have to run related sudo commands.

   I found a way to change the time out at [[http://emacs.stackexchange.com/questions/5608/how-to-let-eshell-remember-sudo-password-for-two-minutes][this
   discussion]]. Essentially, I first added these lines to my /init.el/
   file.

   #+BEGIN_SRC emacs-lisp
(require 'em-tramp) ; to load eshell’s sudo
(setq eshell-prefer-lisp-functions t)
(setq eshell-prefer-lisp-variables t)
   #+END_SRC

   Then, in the eshell, I created the following alias that gets
   permanently saved to my .emacs.d/ directory:

   #+BEGIN_SRC emacs-lisp
alias sudo 'eshell/sudo $*'
   #+END_SRC

   Finally, I added these lines to my /init.el/
   #+BEGIN_SRC emacs-lisp
(setq password-cache t) ; enable password caching
(setq password-cache-expiry 5) ; for five minutes
   #+END_SRC

   After reloading emacs, I found that the password can now be cached.

-----

* Useful keybindings
  + C-h b :: List all keybindings
  + C-h f :: Describe an emacs/elisp function
