stories/notes/emacs.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Notes on things I've learned in emacs">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs Notes | Kyle M. Douglass</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://kmdouglass.github.io/stories/notes/emacs.html">
<!--[if lt IE 9]><![endif]--><meta name="description" itemprop="description" content="Notes on things I've learned in emacs">
<meta name="author" content="Kyle M. Douglass">
<meta property="og:site_name" content="Kyle M. Douglass">
<meta property="og:title" content="Emacs Notes">
<meta property="og:url" content="http://kmdouglass.github.io/stories/notes/emacs.html">
<meta property="og:description" content="Notes on things I've learned in emacs">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2014-01-24T00:00:00+01:00">
<meta property="article:tag" content="emacs">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-fixed-top" role="navigation"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://kmdouglass.github.io/">

                <span id="blog-title">Kyle M. Douglass</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/index.html">Tags</a>
                </li>
<li>
<a href="../notes-and-projects.html">Notes</a>
                </li>
<li>
<a href="../about-me.html">About</a>
                </li>
<li>
<a href="../contact.html">Contact</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="emacs.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Emacs Notes</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li>
<a href="emacs.html#sec-1">1. eshell</a>
<ul>
<li><a href="emacs.html#sec-1-1">1.1. Changing the timeout on sudo</a></li>
</ul>
</li>
<li><a href="emacs.html#sec-2">2. Useful keybindings</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">
<span class="section-number-2">1</span> eshell</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">
<span class="section-number-3">1.1</span> Changing the timeout on sudo</h3>
<div class="outline-text-3" id="text-1-1">
<p>
By default in the eshell, you have to enter your password for sudo
everytime I sudo something. This gets a bit annoying since I often
have to run related sudo commands.
</p>

<p>
I found a way to change the time out at <a href="http://emacs.stackexchange.com/questions/5608/how-to-let-eshell-remember-sudo-password-for-two-minutes">this
discussion</a>. Essentially, I first added these lines to my <i>init.el</i>
file.
</p>

<div class="highlight"><pre><span class="p">(</span><span class="nf">require</span> <span class="ss">'em-tramp</span><span class="p">)</span> <span class="c1">; to load eshell’s sudo</span>
<span class="p">(</span><span class="nf">setq</span> <span class="nv">eshell-prefer-lisp-functions</span> <span class="nv">t</span><span class="p">)</span>
<span class="p">(</span><span class="nf">setq</span> <span class="nv">eshell-prefer-lisp-variables</span> <span class="nv">t</span><span class="p">)</span>
</pre></div>

<p>
Then, in the eshell, I created the following alias that gets
permanently saved to my .emacs.d/ directory:
</p>

<div class="highlight"><pre><span class="nv">alias</span> <span class="nv">sudo</span> <span class="ss">'eshell/sudo</span> <span class="nv">$*</span><span class="o">'</span>
</pre></div>

<p>
Finally, I added these lines to my <i>init.el</i>
</p>
<div class="highlight"><pre><span class="p">(</span><span class="nf">setq</span> <span class="nv">password-cache</span> <span class="nv">t</span><span class="p">)</span> <span class="c1">; enable password caching</span>
<span class="p">(</span><span class="nf">setq</span> <span class="nv">password-cache-expiry</span> <span class="mi">5</span><span class="p">)</span> <span class="c1">; for five minutes</span>
</pre></div>

<p>
After reloading emacs, I found that the password can now be cached.
</p>

<hr>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">
<span class="section-number-2">2</span> Useful keybindings</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> C-h b </dt>
<dd>List all keybindings
</dd>
<dt> C-h f </dt>
<dd>Describe an emacs/elisp function
</dd>
</dl>
</div>
</div>
    </div>
    

</article>
</div>
        <!--End of body content-->

        <footer>
            Contents © 2015         <a href="mailto:kyle.douglass@epfl.ch">Kyle M. Douglass</a> - Powered by         <a href="http://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><!-- Social buttons --><div id="addthisbox" class="addthis_toolbox addthis_peekaboo_style addthis_default_style addthis_label_style addthis_32x32_style">
<a class="addthis_button_more">Share</a>
<ul>
<li>
<a class="addthis_button_facebook"></a>
</li>
<li>
<a class="addthis_button_google_plusone_share"></a>
</li>
<li>
<a class="addthis_button_linkedin"></a>
</li>
<li>
<a class="addthis_button_twitter"></a>
</li>
</ul>
</div>
<script src="//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-4f7088a56bb93798"></script><!-- End of social buttons --><script>jQuery("a.image-reference").colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
